  function myFunction() {
      var x,xyqz,ljqz,sw,zy;
      var jishu=0;
      var myDate=new Array("1月19日","1月20日","1月21日","1月22日","1月23日","1月24日","1月25日","1月26日","1月27日","1月28日","1月29日","1月30日","1月31日","2月1日","2月2日","2月3日","2月4日","2月5日","2月6日","2月7日","2月8日","2月9日","2月10日","2月11日","2月12日","2月13日","2月14日","2月15日","2月16日","2月17日","2月18日","2月19日","2月20日","2月21日","2月22日","2月23日","2月24日","2月25日","2月26日");
      var xyqzs=new Array(0,239,338,399,494,658,958,1303,2567,3349,4334,5486,6738,8565,10532,12712,15679,18483,20677,23139,24881,26965,28532,29659,43455,46429,48175,49030,49847,50338,50633,49665,48730,47647,46439,45054,43369,41660,39755);
      var ljqzs=new Array(0,270,375,444,549,729,1052,1423,2714,3554,4586,5806,7153,9074,11177,13522,16678,19665,22112,24953,27100,29631,31728,33366,48206,51986,54406,56249,58182,59989,61682,62031,62662,63454,64084,64287,64786,65187,65596);
      var sws=new Array(0,6,9,17,24,39,52,76,100,125,162,204,249,294,350,414,479,549,618,699,780,871,974,1068,1310,1426,1457,1596,1696,1789,1921,2029,2144,2250,2346,2495,2563,2615,2641);
      var zys=new Array(0,25,28,28,31,32,42,44,47,80,90,116,166,215,295,396,520,633,817,1115,1439,1795,2222,2639,3441,4131,4774,5623,6639,7862,9128,10337,11788,13557,15299,16738,18854,20912,23200);
    x = document.getElementById("inputdate").value;
   for(var i=0;i<myDate.length;i++){
    if(x==myDate[i]){
      jishu++;
      xyqz=xyqzs[i];
      ljqz=ljqzs[i];
      sw=sws[i];
      zy=zys[i];
    document.getElementById("现有确诊病例").innerHTML = xyqz;
    document.getElementById("累计确诊病例").innerHTML = ljqz;
    document.getElementById("死亡病例").innerHTML = sw;
    document.getElementById("治愈病例").innerHTML = zy;

    }
   }
   if(jishu==0){
    alert("输入内容不符合要求");
   }  
}