  function myFunction() {
      var x,xyqz,ljqz,sw,zy;
      var jishu=0;
      var myDate=new Array("1月19日","1月20日","1月21日","1月22日","1月23日","1月24日","1月25日","1月26日","1月27日","1月28日","1月29日","1月30日","1月31日","2月1日","2月2日","2月3日","2月4日","2月5日","2月6日","2月7日","2月8日","2月9日","2月10日","2月11日","2月12日","2月13日","2月14日","2月15日","2月16日","2月17日","2月18日","2月19日","2月20日","2月21日","2月22日","2月23日","2月24日","2月25日","2月26日");
      var xyqzs=new Array(0,0,1,4,9,32,82,127,167,203,274,347,417,487,550,653,721,795,843,880,896,898,900,896,901,860,843,821,792,733,691,632,531,449,391,322,263,229,190);
      var ljqzs=new Array(0,0,1,4,9,32,83,128,168,206,278,352,422,493,566,675,764,851,914,981,1033,1073,1105,1135,1169,1184,1212,1231,1246,1257,1262,1265,1267,1270,1271,1271,1271,1271,1272);
      var sws=new Array(0,0,0,0,0,0,1,1,1,2,2,2,2,2,2,2,2,2,3,4,6,6,7,8,10,11,13,13,16,19,19,19,19,19,19,19,19,19,20);
      var zys=new Array(0,0,0,0,0,0,0,0,0,1,2,3,3,4,14,20,41,54,68,97,131,169,198,231,258,313,356,397,438,505,552,614,717,802,861,930,989,1023,1062);
    x = document.getElementById("inputdate").value;
   for(var i=0;i<myDate.length;i++){
    if(x==myDate[i]){
      jishu++;
      xyqz=xyqzs[i];
      ljqz=ljqzs[i];
      sw=sws[i];
      zy=zys[i];
    document.getElementById("现有确诊病例").innerHTML = xyqz;
    document.getElementById("累计确诊病例").innerHTML = ljqz;
    document.getElementById("死亡病例").innerHTML = sw;
    document.getElementById("治愈病例").innerHTML = zy;

    }
   }
   if(jishu==0){
    alert("输入内容不符合要求");
   }  
}