 var myChart = echarts.init(document.getElementById('chart'));
  
        var option = {
            title:{
                text:'河南疫情数据统计'
            },
            legend: {
                orient:'horizontal',
                x:'right',
                y:'35px',
                padding:0
            },
            
            tooltip: {
                 trigger: 'axis', 
                 axisPointer: {  
                 type: 'line', 
                 crossStyle: {
                 color: '#fff'
                 }  
                 }

            },
            dataset: {
                
                source: [
                    ['日期','现有确诊病例','累计确诊病例','死亡病例','治愈病例'],
                    ['1月24日',32,32,0,0],
                    ['1月25日',82,83,1,0],
                    ['1月26日',127,128,1,0],
                    ['1月27日',167,168,1,0],
                    ['1月28日',203,206,2,1],
                    ['1月29日',274,278,2,2],
                    ['1月30日',347,352,2,3],
                    ['1月31日',417,422,2,3],
                    ['2月1日',487,493,2,4],
                    ['2月2日',550,566,2,14],
                    ['2月3日',653,675,2,20],
                    ['2月4日',721,764,2,41],
                    ['2月5日',795,851,2,54],
                    ['2月6日',843,914,3,68],
                    ['2月7日',880,981,4,97],
                    ['2月8日',896,1033,6,131],
                    ['2月9日',898,1073,6,169],
                    ['2月10日',900,1105,7,198],
                    ['2月11日',896,1135,8,231],
                    ['2月12日',901,1169,10,258],
                    ['2月13日',860,1184,11,313],
                    ['2月14日',843,1212,13,356],
                    ['2月15日',821,1231,13,397],
                    ['2月16日',792,1246,16,438],
                    ['2月17日',733,1257,19,505],
                    ['2月18日',691,1262,19,552],
                    ['2月19日',632,1265,19,614],
                    ['2月20日',531,1267,19,717],
                    ['2月21日',449,1270,19,802],
                    ['2月22日',391,1271,19,861],
                    ['2月23日',322,1271,19,930],
                    ['2月24日',263,1271,19,989],
                    ['2月25日',229,1271,19,1023],
                    ['2月26日',190,1272,20,1062],
                    
                ]
            },
            
            xAxis: {type: 'category',
                name:'日期',
                axisLabel:{
                    rotate:-45,
                    interval:1
                }, 
                splitArea : {
                show: true,
                areaStyle:{
                    color:['rgba(144,238,144,0.3)','rgba(135,200,250,0.3)']
                }
                }
             },
           
            yAxis: {
                
            },
    
            series: [
                {type: 'line'},
                {type: 'line'},
                {type: 'line'},
                {type: 'line'}
            
            ]
        };
 
    
        myChart.setOption(option);