  function myFunction() {
      var x,xyqz,ljqz,sw,zy;
      var jishu=0;
      var myDate=new Array("1月19日","1月20日","1月21日","1月22日","1月23日","1月24日","1月25日","1月26日","1月27日","1月28日","1月29日","1月30日","1月31日","2月1日","2月2日","2月3日","2月4日","2月5日","2月6日","2月7日","2月8日","2月9日","2月10日","2月11日","2月12日","2月13日","2月14日","2月15日","2月16日","2月17日","2月18日","2月19日","2月20日","2月21日","2月22日","2月23日","2月24日","2月25日","2月26日");
      var xyqzs=new Array(0,0,0,0,9,21,39,63,87,121,144,176,200,220,240,263,285,325,348,369,384,395,414,416,406,406,389,371,364,348,326,304,474,453,439,426,406,393,369);
      var ljqzs=new Array(0,0,0,0,9,21,39,63,87,121,145,178,202,225,246,270,298,343,379,407,435,459,486,497,506,519,530,537,541,543,544,546,748,750,754,755,755,756,756);
      var sws=new Array(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,2,2,2,2,2,2,3,4,4,4,4,4,6,6,6);
      var zys=new Array(0,0,0,0,0,0,0,0,0,0,1,2,2,5,6,7,13,18,31,38,50,63,71,80,98,111,139,164,175,193,215,238,270,293,311,325,
        343,357,381);
    x = document.getElementById("inputdate").value;
   for(var i=0;i<myDate.length;i++){
    if(x==myDate[i]){
      jishu++;
      xyqz=xyqzs[i];
      ljqz=ljqzs[i];
      sw=sws[i];
      zy=zys[i];
    document.getElementById("现有确诊病例").innerHTML = xyqz;
    document.getElementById("累计确诊病例").innerHTML = ljqz;
    document.getElementById("死亡病例").innerHTML = sw;
    document.getElementById("治愈病例").innerHTML = zy;

    }
   }
   if(jishu==0){
    alert("输入内容不符合要求");
   }  
}