 var myChart = echarts.init(document.getElementById('chart'));
  
        var option = {
            title:{
                text:'山东疫情数据统计'
            },
            legend: {
                orient:'horizontal',
                x:'right',
                y:'35px',
                padding:0
            },
            
            tooltip: {
                 trigger: 'axis', 
                 axisPointer: {  
                 type: 'line', 
                 crossStyle: {
                 color: '#fff'
                 }  
                 }

            },
            dataset: {
                
                source: [
                    ['日期','现有确诊病例','累计确诊病例','死亡病例','治愈病例'],
                    ['1月24日',21,21,0,0],
                    ['1月25日',39,39,0,0],
                    ['1月26日',63,63,0,0],
                    ['1月27日',87,87,0,0],
                    ['1月28日',121,121,0,0],
                    ['1月29日',144,145,0,1],
                    ['1月30日',176,178,0,2],
                    ['1月31日',200,202,0,2],
                    ['2月1日',220,225,0,5],
                    ['2月2日',240,246,0,6],
                    ['2月3日',263,270,0,7],
                    ['2月4日',285,298,0,13],
                    ['2月5日',325,343,0,18],
                    ['2月6日',348,379,0,31],
                    ['2月7日',369,407,0,38],
                    ['2月8日',384,435,1,50],
                    ['2月9日',395,459,1,63],
                    ['2月10日',414,486,1,71],
                    ['2月11日',416,497,1,80],
                    ['2月12日',406,506,2,98],
                    ['2月13日',406,519,2,111],
                    ['2月14日',389,530,2,139],
                    ['2月15日',371,537,2,164],
                    ['2月16日',364,541,2,175],
                    ['2月17日',348,543,2,193],
                    ['2月18日',326,544,3,215],
                    ['2月19日',304,546,4,238],
                    ['2月20日',474,748,4,270],
                    ['2月21日',453,750,4,293],
                    ['2月22日',439,754,4,311],
                    ['2月23日',426,755,4,325],
                    ['2月24日',406,755,6,343],
                    ['2月25日',393,756,6,357],
                    ['2月26日',369,756,6,381],
                    
                ]
            },
            
            xAxis: {type: 'category',
                name:'日期',
                axisLabel:{
                    rotate:-45,
                    interval:1
                }, 
                splitArea : {
                show: true,
                areaStyle:{
                    color:['rgba(144,238,144,0.3)','rgba(135,200,250,0.3)']
                }
                }
             },
           
            yAxis: {
                
            },
    
            series: [
                {type: 'line'},
                {type: 'line'},
                {type: 'line'},
                {type: 'line'}
            
            ]
        };
 
    
        myChart.setOption(option);