 var myChart = echarts.init(document.getElementById('chart'));
  
        var option = {
            title:{
                text:'浙江疫情数据统计'
            },
            legend: {
                orient:'horizontal',
                x:'right',
                y:'35px',
                padding:0
            },
            
            tooltip: {
                 trigger: 'axis', 
                 axisPointer: {  
                 type: 'line', 
                 crossStyle: {
                 color: '#fff'
                 }  
                 }

            },
            dataset: {
                
                source: [
                    ['日期','现有确诊病例','累计确诊病例','死亡病例','治愈病例'],
                    ['1月24日',61,62,0,1],
                    ['1月25日',103,104,0,1],
                    ['1月26日',127,128,0,1],
                    ['1月27日',172,173,0,1],
                    ['1月28日',293,296,0,3],
                    ['1月29日',424,428,0,4],
                    ['1月30日',528,537,0,9],
                    ['1月31日',584,599,0,15],
                    ['2月1日',638,661,0,23],
                    ['2月2日',688,724,0,36],
                    ['2月3日',781,829,0,48],
                    ['2月4日',832,895,0,63],
                    ['2月5日',873,954,0,81],
                    ['2月6日',908,1006,0,98],
                    ['2月7日',921,1048,0,127],
                    ['2月8日',902,1075,0,173],
                    ['2月9日',891,1092,0,201],
                    ['2月10日',867,1117,0,250],
                    ['2月11日',852,1131,0,279],
                    ['2月12日',818,1145,0,327],
                    ['2月13日',788,1155,0,367],
                    ['2月14日',753,1162,0,409],
                    ['2月15日',730,1167,0,437],
                    ['2月16日',701,1171,0,470],
                    ['2月17日',658,1172,0,514],
                    ['2月18日',629,1173,0,544],
                    ['2月19日',566,1175,0,609],
                    ['2月20日',555,1203,1,647],
                    ['2月21日',510,1205,1,694],
                    ['2月22日',475,1205,1,729],
                    ['2月23日',439,1205,1,765],
                    ['2月24日',410,1205,1,794],
                    ['2月25日',390,1205,1,814],
                    ['2月26日',323,1205,1,881],
                    
                    
                ]
            },
            
            xAxis: {type: 'category',
                name:'日期',
                axisLabel:{
                    rotate:-45,
                    interval:1
                }, 
                splitArea : {
                show: true,
                areaStyle:{
                    color:['rgba(144,238,144,0.3)','rgba(135,200,250,0.3)']
                }
                }
             },
           
            yAxis: {
                
            },
    
            series: [
                {type: 'line'},
                {type: 'line'},
                {type: 'line'},
                {type: 'line'}
            
            ]
        };
 
    
        myChart.setOption(option);